# Даны 2 действительных числа a и b.
# Получить их сумму, разность и произведение.


a = 2312
b = 4878
sum_ab = a + b
sub_ab = a - b
multi_ab = a * b
print('a + b = ', sum_ab, '\na - b =', sub_ab, '\na * b =', multi_ab)
