# Даны катеты прямоугольного треугольника. Найти его гипотенузу и площадь

a = 5
b = 10
hypotenuse = (a ** 2 + b ** 2) ** (1 / 2)
square = 0.5 * (a * b)
print(f'Прилежащий катет равен {a}')
print(f'Протеволжащий катет равен {b}')
print(f'Гипотенуза прямоугольного треугольника равна {hypotenuse}')
print(f'Площадь прямоугольного треугольника равна {square}')
