# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение

a = 3.4
b = 5
summ = a + b
print(f'Сумма {a} и {b} равна {summ}')
diff = a - b
print(f'Разность {a} и {b} равна {diff}')
multiplication = b * a
print(f'Произведение {a} и {b} равно {multiplication}')
