# Даны действительные числа x и y. Получить x − y / 1 + xy

x = 7
y = 3
print(x - y / 1 + x * y)
