# Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел


a = 7
b = 12
a_mean = (a + b) / 2
g_mean = (a * b) ** 0.5
print(a_mean)
print(g_mean)
