# Даны действительные числа x и y. Получить x − y / 1 + xy

x = 5678
y = 4567

print(f'\nx - y = {x - y}\n1 + xy = {1 + x * y}')
