# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение

a = 55
b = 37

summ = sum([a, b])
diff = a - b
mult = a * b

print(f'\na + b = {summ}\na - b = {diff}\na * b = {mult}')
